const sorting = require("../../app");

describe("Books names test suit", () => {
  it("Books names should be sorted in ascending order", () => {
    expect(
      sorting.sortByName([
        "Гарри Поттер",
        "Властелин Колец",
        "Волшебник изумрудного города",
      ])
    ).toEqual([
      "Властелин Колец",
      "Волшебник изумрудного города",
      "Гарри Поттер",
    ]);
  });

  it("Books should be sorted by similar titles.", () => {
    expect(
      sorting.sortByName([
      "Властелин Колец",
      "Волшебник изумрудного города",
      "Гарри Поттер",
      "Властелин Колец",
      "Волшебник изумрудного города",
      "Гарри Поттер",
      ])
    ).toEqual([
      "Властелин Колец",
      "Властелин Колец",
      "Волшебник изумрудного города",
      "Волшебник изумрудного города",
      "Гарри Поттер",
      "Гарри Поттер",
    ]);
  });
});
